# DataFrame

In [1]:
import numpy as np
import pandas as pd
%matplotlib inline

In [4]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
pd.DataFrame([5, 6])

   0
0  5
1  6

In [8]:
pd.DataFrame([[5, 6]])

   0  1
0  5  6

In [9]:
pd.DataFrame([
    [5, 6],
    [1, 3]
], index=['r1', 'r2'], columns=['c1', 'c2'])

    c1  c2
r1   5   6
r2   1   3

In [10]:
pd.DataFrame({
    'c1': [5, 1],
    'c2': [6, 3]
}, index=['r1', 'r2'])

    c1  c2
r1   5   6
r2   1   3

In [12]:
upcast_df = pd.DataFrame([
    [1, 2],
    [3, 4.0]
])
upcast_df

   0    1
0  1  2.0
1  3  4.0

In [13]:
upcast_df.dtypes

0      int64
1    float64
dtype: object

In [14]:
df = pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6]
])
df

   0  1  2
0  1  2  3
1  4  5  6

In [32]:
df.append([[7, 8, 9]]), df.append([[7, 8, 9]], ignore_index=True)

(   0  1  2
 0  1  2  3
 1  4  5  6
 0  7  8  9,
    0  1  2
 0  1  2  3
 1  4  5  6
 2  7  8  9)

In [19]:
dn = df.append([[7, 8, 9]]).append(pd.Series([10, 11, 12], name='x'))
dn

    0   1   2
0   1   2   3
1   4   5   6
0   7   8   9
x  10  11  12

In [23]:
dn.drop(labels='x')

   0  1  2
0  1  2  3
1  4  5  6
0  7  8  9

In [26]:
dn.drop(labels=[0])

    0   1   2
1   4   5   6
x  10  11  12

In [30]:
dn.loc[0]

   0  1  2
0  1  2  3
0  7  8  9

In [33]:
dnew = pd.DataFrame({
    'c1': [1, 2],
    'c2': [3, 4],
    'c3': [5, 6]
}, index=['r1', 'r2'])
dnew

    c1  c2  c3
r1   1   3   5
r2   2   4   6

In [34]:
dnew.drop(labels='r1')

    c1  c2  c3
r2   2   4   6

In [38]:
dnew.drop(labels=['c1', 'c2'], axis=1)

    c3
r1   5
r2   6

In [39]:
dnew.drop(columns=['c3'])

    c1  c2
r1   1   3
r2   2   4